var DoubanBook = {
    "rating": {
        "max": 10,
        "numRaters": 858,
        "average": "8.2",
        "min": 0
    },
    "author": ["这么远那么近"],
    "pubdate": "2015-2-1",
    "image": "http:\/\/img3.douban.com\/mpic\/s27978403.jpg",
    "binding": "平装",
    "translator": [],
    "catalog": "代序  任汝千圣现，我有天真佛  （文\/大冰）\n第一辑  每个人都在用力地活着，用自己的方式\n走好，姑娘\n你好，姑娘\n还好，姑娘\n加油，姑娘\n约么，姑娘\n第二辑  只想过好这一生\n就当一次路过\n去你的人生海海\n昨夜星辰昨日风\n再给我一块花馍馍\n第三辑  我们都要好好的\n你爱的是他爱你的感觉\n你来过，我才难过\n我爱你，但也只能到此为止\n无论你倦鸟归林，还是云游四海，我一直在\n感谢你，没有选择放弃\n怀念  我该如何说再见\n旧梦依稀，往事迷离\n此生未了，来生再续\n愿勿相负，愿勿相忘\n山高路远，后会有期\n后记  念念不忘，必有回想",
    "pages": "282",
    "publisher": "江苏凤凰文艺出版社",
    "isbn13": "9787539978406",
    "title": "我知道你没那么坚强",
    "author_intro": "这么远那么近。本名贾文宇。\n畅销书作家，电台主播，广告人，国家二级心理咨询师、心理催眠师，人力资源管理师。\n2011年戛纳国际创意节银狮奖。 2012年百家传媒新锐媒体人奖。 2012年苹果官方艺术类最佳播主。 2013年喜马拉雅情感类最佳博主。\n曾出版：《爱上 一个人 的花开》《 最后一个夏天》《无尽意》《自然而然》《有些路，只能一个人走》等作品。\n新浪微博：http:\/\/weibo.com\/yuanjins\n公众微信：yuanjin0412",
    "summary": "你的坚强，都是柔软生的茧。\n以前特别害怕失去，不管是物质还是感情，后来经历的多了，渐渐地学会了独撑和豁达。如今再也不担心谁会走，再也不担心会变穷，因为知道失去的自己依然可以再挣回来。\n对自己的信心，就是最大的安全感，无需外物来证实和陪衬。\n心情不好就少听悲伤的歌，饿了就自己找吃的，怕黑就开灯，想要的就自己赚钱买。谁都没比谁生活的更容易，只是有的人怨天尤人，而有的人却默默咬着牙，逼自己学会坚强。\n经历过生命中无数突如其来的繁华和苍凉，你已从弱小的身影变成别人可依靠的肩膀。\n编辑推荐\n●每个人都在用力地活着，用自己的方式。\n《我知道你没那么坚强》讲述了20个年轻人艰难应对生活考验的故事。书中的他们，不过是我们的缩影。\n原来每个成年人，真的都是劫后余生。\n●生活出了狠招，愿你接得不慌不忙，过上自己想过的生活。\n生活中大大小小的考验数之不尽，不要把考验当伤痕，要懂得忘记和原谅。\n\n●《乖，摸摸头》作者大冰倾情作序，为远近点赞。\n远近：你告诉我说，整本书都是真实的故事。为“真实”二字点个赞。真实的故事自有千钧之力。既然你书写的是人性中的向阳面，那就请继续真实地去写吧。——大冰\n●前所未有的伴读歌单规模及创意格局，看最动人的故事，听最感人的歌。\n恒大音乐企划总监流水纪先生，亲自为新书撰写四辑歌单引言及推荐歌曲。网易云音乐独家音乐平台媒体支持。《我知道你没那么坚强》读者独享，轻扫书中二维码即可进入。",
    "price": "36.80"
};